---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceType.op_Equality(Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceType)
source: html/cc0b954e-bbdb-a6eb-85b9-5158afe60206.htm
---
# Autodesk.Revit.DB.ExternalResourceType.op_Equality Method

Compares two ExternalResourceType instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	ExternalResourceType first,
	ExternalResourceType second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalResourceType`) - The first ExternalResourceType.
- **second** (`Autodesk.Revit.DB.ExternalResourceType`) - The second ExternalResourceType.

## Returns
True if the inputs are identical, false if they are different.